/* 简单选择排序 
   从大到小：假设第一个数为最大，与后面的数依次比较，
            记录下真正的最大值及其位置，再与第一个数互换，
			然后再假设第二个数为次大，重复上述操作*/

#include <stdio.h>
int main(int argc, const char *argv[])
{
	int a[10] = {1,5,3,2,9,6,8,4,0,7};
	int max;

	for(i=0; i<9; i++)   //10个数轮询9次
	{
		max = a[i];  //假设最大值
		for(j=i+1; j<4; j++)
		{
			printf("%3d", a[i][j]);
		}
		printf("\n");
	}

	printf("\n");

	for(i=0; i<3; i++)   //互换规律：[0][1]<->[1][0]
	{                             // [0][2]<->[2][0]
		for(j=i+1; j<4; j++)      // [0][3]<->[3][0]
		{                         // [1][2]<->[2][1]
			temp = a[i][j];       // [1][3]<->[3][1]
			a[i][j] = a[j][i];    // [2][3]<->[3][2]
			a[j][i] = temp;
		}
	}

	for(i=0; i<4; i++)
	{
		for(j=0; j<4; j++)
		{
			printf("%3d", a[i][j]);
		}
		printf("\n");
	}
	return 0;
}
